{
    "name": "zot24",
    "headline": "Engineering Leader",
    "summary": "23 years as a software engineer, including 10 years building cloud platforms and scalable infrastructure. Entrepreneur and seed investor, currently based in Paraguay after years of traveling globally.",
    "skills": [
        "Kubernetes",
        "Terraform",
        "AWS",
        "GCP",
        "Azure",
        "Go",
        "Platform Engineering"
    ],
    "experience": [
        {
            "title": "Strategic Advisor & Seed Investor",
            "company": "Smartloop",
            "period": "Apr 2023 - Present",
            "location": "San Francisco Bay Area",
            "highlights": [
                "Seed investor providing critical funding and strategic expertise during early growth stages",
                "Guiding transition from legal services to AI-driven document analysis platform",
                "Driving Web3 integration including decentralized storage and tokenomics",
                "Advising on business strategy, contract negotiations, and fundraising initiatives"
            ],
            "technologies": [
                "AI",
                "Web3",
                "Business Strategy",
                "Tokenomics"
            ]
        },
        {
            "title": "Senior Cloud Engineer",
            "company": "BlackRock",
            "period": "Feb 2023 - Jan 2025",
            "location": "San Francisco Bay Area",
            "highlights": [
                "Designed Chaos Engineering scenarios with LitmusChaos, increasing test coverage by 30%",
                "Enhanced observability with new monitoring cases and optimized dashboards",
                "Revamped CI pipelines with simplified workflows and new templates",
                "Migrated legacy Terraform code with remote backends, eliminating race conditions"
            ],
            "technologies": [
                "LitmusChaos",
                "Terraform",
                "CI/CD",
                "Observability",
                "Kubernetes"
            ]
        },
        {
            "title": "Senior Cloud Platform Engineer",
            "company": "Anaplan",
            "period": "Nov 2019 - Jan 2022",
            "location": "San Francisco Bay Area",
            "highlights": [
                "Led team delivering high-availability AWS environments, reducing provisioning time by 25%",
                "Coordinated production releases across multiple teams and enterprise clients",
                "Optimized GCP infrastructure (GKE), increasing platform user retention by 23%",
                "Built automated infrastructure testing with Terratest/Go, achieving 70% coverage",
                "Contributed features to community Terraform providers"
            ],
            "technologies": [
                "AWS",
                "EKS",
                "Terraform",
                "GCP",
                "GKE",
                "Go",
                "Terratest"
            ],
            "testimonials": [
                {
                    "name": "Richard Sposato",
                    "role": "Development Team Lead",
                    "text": "I managed Israel while we both worked on the Platform Infrastructure team at Anaplan. While working with him, I quickly learned he was a capable addition to our team. He was professional in communicating with others, competent in getting his work done well and on time, and a team player who worked well with everyone. [...] His hard work and technical skills helped us complete the Lion project on time. [...] He has my full confidence."
                }
            ]
        },
        {
            "title": "Senior Infrastructure Engineer",
            "company": "Entelo",
            "period": "Nov 2018 - Oct 2019",
            "location": "San Francisco Bay Area",
            "highlights": [
                "Built high-availability monitoring for all Kubernetes clusters (Prometheus, Grafana, Thanos, Loki)",
                "Created custom Prometheus exporter in Go, reducing AWS bills by 45%",
                "Containerized applications and improved delivery pipelines, cutting release times by 35%",
                "Implemented service mesh with Kubernetes, Istio, and Spinnaker"
            ],
            "technologies": [
                "Kubernetes",
                "Prometheus",
                "Grafana",
                "Thanos",
                "Go",
                "Istio",
                "Spinnaker"
            ],
            "testimonials": [
                {
                    "name": "Jason Rosendale",
                    "role": "Software Engineer",
                    "text": "It's difficult to write a recommendation that does service to Israel's level of expertise or the importance that his work has made to the engineering team at Entelo. [...] The engineering team relies heavily on him (he knows our infrastructure inside and out, he built our deployment pipeline, he set up our metrics and logging systems); but at the same time he has made sure that the engineering team does not need to rely on him [...] He prevents engineers from having to spend their time dealing with infrastructure [...] I could not do my job effectively without Israel's help."
                }
            ]
        },
        {
            "title": "Infrastructure Engineer",
            "company": "Moltin",
            "period": "Nov 2016 - Sep 2018",
            "location": "Newcastle upon Tyne, UK",
            "highlights": [
                "Sole infrastructure engineer architecting customer-facing systems on AWS and Azure",
                "Built highly available infrastructure with Ansible, Terraform, and Docker",
                "Implemented service mesh using Rancher/Cattle and Linkerd",
                "Established CI/CD (Jenkins), monitoring (Datadog), and logging (ELK Stack) platforms"
            ],
            "technologies": [
                "Ansible",
                "Terraform",
                "AWS",
                "Azure",
                "Docker",
                "Rancher",
                "Linkerd",
                "Jenkins"
            ]
        },
        {
            "title": "Platform Engineer",
            "company": "Moltin",
            "period": "Sep 2015 - Nov 2016",
            "location": "Newcastle upon Tyne, UK",
            "highlights": [
                "Built and maintained product through monolith-to-microservices evolution",
                "Worked across full stack: PHP, Laravel, Go, Node.js, Nginx",
                "Managed data layer with Scylla, Elasticsearch, Redis, RabbitMQ, PostgreSQL"
            ],
            "technologies": [
                "PHP",
                "Laravel",
                "Go",
                "Node.js",
                "Nginx",
                "PostgreSQL",
                "Redis",
                "Elasticsearch"
            ]
        },
        {
            "title": "Software Engineer",
            "company": "Contactzilla",
            "period": "Sep 2014 - Aug 2015",
            "location": "Bristol, UK",
            "highlights": [
                "Main engineer for SaaS contact management platform",
                "Fixed customer issues while refactoring legacy Zend Framework codebase",
                "Architected new distributed system using Laravel and Symfony"
            ],
            "technologies": [
                "PHP",
                "Zend Framework",
                "Laravel",
                "Symfony",
                "MySQL"
            ],
            "testimonials": [
                {
                    "name": "Tom Holder",
                    "role": "Chief Executive Officer",
                    "text": "I worked with Israel for a couple of years on our SaaS product ContactZilla. Working with Israel was a delight. He's an enthusiastic, smart and considered character with a real ability to learn knew technologies. He's never phased by a challenge and approaches everything with a professional manner and importantly with good humour. I'd definitely not hesitate to work with Israel again."
                }
            ]
        },
        {
            "title": "Software Developer",
            "company": "Shiptheory",
            "period": "Jun 2013 - Jun 2014",
            "location": "Bristol, UK",
            "highlights": [
                "Integrated carrier APIs: DHL, myHermes, Parcelforce",
                "Built payment platform integrations: PayPal, Authorize.net",
                "Developed robust APIs enabling automated shipping workflows"
            ],
            "technologies": [
                "PHP",
                "MySQL",
                "Python",
                "Flask",
                "REST APIs"
            ],
            "testimonials": [
                {
                    "name": "Mark Mikkelson",
                    "role": "Co-Founder",
                    "text": "Israel is a hardworking knowledgeable guy. He always seems up-to-date with the new trends and technologies and is versatile in a number of languages and environments."
                }
            ]
        }
    ]
}